7767517
252 270
Input            input                    0 1 input
Convolution      469                      1 1 input 469 0=32 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=864
BatchNorm        470                      1 1 469 470 0=32
ReLU             471                      1 1 470 471
Convolution      472                      1 1 471 472 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=1024
BatchNorm        473                      1 1 472 473 0=32
ReLU             474                      1 1 473 474
ConvolutionDepthWise 475                      1 1 474 475 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=288 7=32
BatchNorm        476                      1 1 475 476 0=32
ReLU             477                      1 1 476 477
Convolution      478                      1 1 477 478 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=512
BatchNorm        479                      1 1 478 479 0=16
Convolution      480                      1 1 479 480 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=1536
BatchNorm        481                      1 1 480 481 0=96
ReLU             482                      1 1 481 482
ConvolutionDepthWise 483                      1 1 482 483 0=96 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=864 7=96
BatchNorm        484                      1 1 483 484 0=96
ReLU             485                      1 1 484 485
Convolution      486                      1 1 485 486 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=2304
BatchNorm        487                      1 1 486 487 0=24
Split            splitncnn_0              1 2 487 487_splitncnn_0 487_splitncnn_1
Convolution      488                      1 1 487_splitncnn_1 488 0=144 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=3456
BatchNorm        489                      1 1 488 489 0=144
ReLU             490                      1 1 489 490
ConvolutionDepthWise 491                      1 1 490 491 0=144 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1296 7=144
BatchNorm        492                      1 1 491 492 0=144
ReLU             493                      1 1 492 493
Convolution      494                      1 1 493 494 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=3456
BatchNorm        495                      1 1 494 495 0=24
BinaryOp         496                      2 1 487_splitncnn_0 495 496 0=0
Split            splitncnn_1              1 2 496 496_splitncnn_0 496_splitncnn_1
Convolution      497                      1 1 496_splitncnn_1 497 0=144 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=3456
BatchNorm        498                      1 1 497 498 0=144
ReLU             499                      1 1 498 499
ConvolutionDepthWise 500                      1 1 499 500 0=144 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=1296 7=144
BatchNorm        501                      1 1 500 501 0=144
ReLU             502                      1 1 501 502
Convolution      503                      1 1 502 503 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=4608
BatchNorm        504                      1 1 503 504 0=32
Split            splitncnn_2              1 2 504 504_splitncnn_0 504_splitncnn_1
Convolution      505                      1 1 504_splitncnn_1 505 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=6144
BatchNorm        506                      1 1 505 506 0=192
ReLU             507                      1 1 506 507
ConvolutionDepthWise 508                      1 1 507 508 0=192 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1728 7=192
BatchNorm        509                      1 1 508 509 0=192
ReLU             510                      1 1 509 510
Convolution      511                      1 1 510 511 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=6144
BatchNorm        512                      1 1 511 512 0=32
BinaryOp         513                      2 1 504_splitncnn_0 512 513 0=0
Split            splitncnn_3              1 2 513 513_splitncnn_0 513_splitncnn_1
Convolution      514                      1 1 513_splitncnn_1 514 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=6144
BatchNorm        515                      1 1 514 515 0=192
ReLU             516                      1 1 515 516
ConvolutionDepthWise 517                      1 1 516 517 0=192 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1728 7=192
BatchNorm        518                      1 1 517 518 0=192
ReLU             519                      1 1 518 519
Convolution      520                      1 1 519 520 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=6144
BatchNorm        521                      1 1 520 521 0=32
BinaryOp         522                      2 1 513_splitncnn_0 521 522 0=0
Split            splitncnn_4              1 2 522 522_splitncnn_0 522_splitncnn_1
Convolution      523                      1 1 522_splitncnn_1 523 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=6144
BatchNorm        524                      1 1 523 524 0=192
ReLU             525                      1 1 524 525
ConvolutionDepthWise 526                      1 1 525 526 0=192 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=1728 7=192
BatchNorm        527                      1 1 526 527 0=192
ReLU             528                      1 1 527 528
Convolution      529                      1 1 528 529 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=12288
BatchNorm        530                      1 1 529 530 0=64
Split            splitncnn_5              1 2 530 530_splitncnn_0 530_splitncnn_1
Convolution      531                      1 1 530_splitncnn_1 531 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=24576
BatchNorm        532                      1 1 531 532 0=384
ReLU             533                      1 1 532 533
ConvolutionDepthWise 534                      1 1 533 534 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=3456 7=384
BatchNorm        535                      1 1 534 535 0=384
ReLU             536                      1 1 535 536
Convolution      537                      1 1 536 537 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=24576
BatchNorm        538                      1 1 537 538 0=64
BinaryOp         539                      2 1 530_splitncnn_0 538 539 0=0
Split            splitncnn_6              1 2 539 539_splitncnn_0 539_splitncnn_1
Convolution      540                      1 1 539_splitncnn_1 540 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=24576
BatchNorm        541                      1 1 540 541 0=384
ReLU             542                      1 1 541 542
ConvolutionDepthWise 543                      1 1 542 543 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=3456 7=384
BatchNorm        544                      1 1 543 544 0=384
ReLU             545                      1 1 544 545
Convolution      546                      1 1 545 546 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=24576
BatchNorm        547                      1 1 546 547 0=64
BinaryOp         548                      2 1 539_splitncnn_0 547 548 0=0
Split            splitncnn_7              1 2 548 548_splitncnn_0 548_splitncnn_1
Convolution      549                      1 1 548_splitncnn_1 549 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=24576
BatchNorm        550                      1 1 549 550 0=384
ReLU             551                      1 1 550 551
ConvolutionDepthWise 552                      1 1 551 552 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=3456 7=384
BatchNorm        553                      1 1 552 553 0=384
ReLU             554                      1 1 553 554
Convolution      555                      1 1 554 555 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=24576
BatchNorm        556                      1 1 555 556 0=64
BinaryOp         557                      2 1 548_splitncnn_0 556 557 0=0
Convolution      558                      1 1 557 558 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=24576
BatchNorm        559                      1 1 558 559 0=384
ReLU             560                      1 1 559 560
ConvolutionDepthWise 561                      1 1 560 561 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=3456 7=384
BatchNorm        562                      1 1 561 562 0=384
ReLU             563                      1 1 562 563
Convolution      564                      1 1 563 564 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=36864
BatchNorm        565                      1 1 564 565 0=96
Split            splitncnn_8              1 2 565 565_splitncnn_0 565_splitncnn_1
Convolution      566                      1 1 565_splitncnn_1 566 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=55296
BatchNorm        567                      1 1 566 567 0=576
ReLU             568                      1 1 567 568
ConvolutionDepthWise 569                      1 1 568 569 0=576 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=5184 7=576
BatchNorm        570                      1 1 569 570 0=576
ReLU             571                      1 1 570 571
Convolution      572                      1 1 571 572 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=55296
BatchNorm        573                      1 1 572 573 0=96
BinaryOp         574                      2 1 565_splitncnn_0 573 574 0=0
Split            splitncnn_9              1 2 574 574_splitncnn_0 574_splitncnn_1
Convolution      575                      1 1 574_splitncnn_1 575 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=55296
BatchNorm        576                      1 1 575 576 0=576
ReLU             577                      1 1 576 577
ConvolutionDepthWise 578                      1 1 577 578 0=576 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=5184 7=576
BatchNorm        579                      1 1 578 579 0=576
ReLU             580                      1 1 579 580
Convolution      581                      1 1 580 581 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=55296
BatchNorm        582                      1 1 581 582 0=96
BinaryOp         583                      2 1 574_splitncnn_0 582 583 0=0
Split            splitncnn_10             1 2 583 583_splitncnn_0 583_splitncnn_1
Convolution      584                      1 1 583_splitncnn_1 584 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=55296
BatchNorm        585                      1 1 584 585 0=576
ReLU             586                      1 1 585 586
ConvolutionDepthWise 587                      1 1 586 587 0=576 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=5184 7=576
BatchNorm        588                      1 1 587 588 0=576
ReLU             589                      1 1 588 589
Convolution      590                      1 1 589 590 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=92160
BatchNorm        591                      1 1 590 591 0=160
Split            splitncnn_11             1 2 591 591_splitncnn_0 591_splitncnn_1
Convolution      592                      1 1 591_splitncnn_1 592 0=960 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=153600
BatchNorm        593                      1 1 592 593 0=960
ReLU             594                      1 1 593 594
ConvolutionDepthWise 595                      1 1 594 595 0=960 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=8640 7=960
BatchNorm        596                      1 1 595 596 0=960
ReLU             597                      1 1 596 597
Convolution      598                      1 1 597 598 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=153600
BatchNorm        599                      1 1 598 599 0=160
BinaryOp         600                      2 1 591_splitncnn_0 599 600 0=0
Split            splitncnn_12             1 2 600 600_splitncnn_0 600_splitncnn_1
Convolution      601                      1 1 600_splitncnn_1 601 0=960 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=153600
BatchNorm        602                      1 1 601 602 0=960
ReLU             603                      1 1 602 603
ConvolutionDepthWise 604                      1 1 603 604 0=960 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=8640 7=960
BatchNorm        605                      1 1 604 605 0=960
ReLU             606                      1 1 605 606
Convolution      607                      1 1 606 607 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=153600
BatchNorm        608                      1 1 607 608 0=160
BinaryOp         609                      2 1 600_splitncnn_0 608 609 0=0
Convolution      610                      1 1 609 610 0=960 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=153600
BatchNorm        611                      1 1 610 611 0=960
ReLU             612                      1 1 611 612
ConvolutionDepthWise 613                      1 1 612 613 0=960 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=8640 7=960
BatchNorm        614                      1 1 613 614 0=960
ReLU             615                      1 1 614 615
Convolution      616                      1 1 615 616 0=320 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=307200
BatchNorm        617                      1 1 616 617 0=320
Split            splitncnn_13             1 2 617 617_splitncnn_0 617_splitncnn_1
ConvolutionDepthWise 618                      1 1 617_splitncnn_1 618 0=320 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2880 7=320
BatchNorm        619                      1 1 618 619 0=320
ReLU             620                      1 1 619 620
Convolution      621                      1 1 620 621 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=30720
BatchNorm        622                      1 1 621 622 0=96
ReLU             623                      1 1 622 623
ConvolutionDepthWise 624                      1 1 623 624 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=864 7=96
BatchNorm        625                      1 1 624 625 0=96
ReLU             626                      1 1 625 626
Convolution      627                      1 1 626 627 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=9216
BatchNorm        628                      1 1 627 628 0=96
Convolution      629                      1 1 617_splitncnn_0 629 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=30720
BatchNorm        630                      1 1 629 630 0=96
BinaryOp         631                      2 1 628 630 631 0=0
ReLU             632                      1 1 631 632
Deconvolution    633                      1 1 632 633 0=96 1=4 11=4 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=147456
BinaryOp         634                      2 1 583_splitncnn_0 633 634 0=0
Split            splitncnn_14             1 2 634 634_splitncnn_0 634_splitncnn_1
ConvolutionDepthWise 635                      1 1 634_splitncnn_1 635 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=864 7=96
BatchNorm        636                      1 1 635 636 0=96
ReLU             637                      1 1 636 637
Convolution      638                      1 1 637 638 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=3072
BatchNorm        639                      1 1 638 639 0=32
ReLU             640                      1 1 639 640
ConvolutionDepthWise 641                      1 1 640 641 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=288 7=32
BatchNorm        642                      1 1 641 642 0=32
ReLU             643                      1 1 642 643
Convolution      644                      1 1 643 644 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=1024
BatchNorm        645                      1 1 644 645 0=32
Convolution      646                      1 1 634_splitncnn_0 646 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=3072
BatchNorm        647                      1 1 646 647 0=32
BinaryOp         648                      2 1 645 647 648 0=0
ReLU             649                      1 1 648 649
Deconvolution    650                      1 1 649 650 0=32 1=4 11=4 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=16384
BinaryOp         651                      2 1 522_splitncnn_0 650 651 0=0
Split            splitncnn_15             1 2 651 651_splitncnn_0 651_splitncnn_1
ConvolutionDepthWise 652                      1 1 651_splitncnn_1 652 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=288 7=32
BatchNorm        653                      1 1 652 653 0=32
ReLU             654                      1 1 653 654
Convolution      655                      1 1 654 655 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=768
BatchNorm        656                      1 1 655 656 0=24
ReLU             657                      1 1 656 657
ConvolutionDepthWise 658                      1 1 657 658 0=24 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=216 7=24
BatchNorm        659                      1 1 658 659 0=24
ReLU             660                      1 1 659 660
Convolution      661                      1 1 660 661 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=576
BatchNorm        662                      1 1 661 662 0=24
Convolution      663                      1 1 651_splitncnn_0 663 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=768
BatchNorm        664                      1 1 663 664 0=24
BinaryOp         665                      2 1 662 664 665 0=0
ReLU             666                      1 1 665 666
Deconvolution    667                      1 1 666 667 0=24 1=4 11=4 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=9216
BinaryOp         668                      2 1 496_splitncnn_0 667 668 0=0
Split            splitncnn_16             1 2 668 668_splitncnn_0 668_splitncnn_1
ConvolutionDepthWise 669                      1 1 668_splitncnn_1 669 0=24 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=216 7=24
BatchNorm        670                      1 1 669 670 0=24
ReLU             671                      1 1 670 671
Convolution      672                      1 1 671 672 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=384
BatchNorm        673                      1 1 672 673 0=16
ReLU             674                      1 1 673 674
ConvolutionDepthWise 675                      1 1 674 675 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=144 7=16
BatchNorm        676                      1 1 675 676 0=16
ReLU             677                      1 1 676 677
Convolution      678                      1 1 677 678 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=256
BatchNorm        679                      1 1 678 679 0=16
Convolution      680                      1 1 668_splitncnn_0 680 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=384
BatchNorm        681                      1 1 680 681 0=16
BinaryOp         682                      2 1 679 681 682 0=0
ReLU             683                      1 1 682 683
Deconvolution    684                      1 1 683 684 0=16 1=4 11=4 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=4096
Split            splitncnn_17             1 2 684 684_splitncnn_0 684_splitncnn_1
ConvolutionDepthWise 685                      1 1 684_splitncnn_1 685 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=144 7=16
BatchNorm        686                      1 1 685 686 0=16
ReLU             687                      1 1 686 687
Convolution      688                      1 1 687 688 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=128
BatchNorm        689                      1 1 688 689 0=8
ReLU             690                      1 1 689 690
ConvolutionDepthWise 691                      1 1 690 691 0=8 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=72 7=8
BatchNorm        692                      1 1 691 692 0=8
ReLU             693                      1 1 692 693
Convolution      694                      1 1 693 694 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=64
BatchNorm        695                      1 1 694 695 0=8
Convolution      696                      1 1 684_splitncnn_0 696 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=128
BatchNorm        697                      1 1 696 697 0=8
BinaryOp         698                      2 1 695 697 698 0=0
ReLU             699                      1 1 698 699
Deconvolution    700                      1 1 699 700 0=8 1=4 11=4 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=1024
Convolution      output                   1 1 700 output 0=2 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=144
